БСП_ВА/src/Enums/СостоянияПриложений/СостоянияПриложений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияПриложений</name>
  <enumValues>
    <name>Новая</name>
  </enumValues>
  <enumValues>
    <name>Готово</name>
  </enumValues>
  <enumValues>
    <name>ГотовитсяКИспользованию</name>
  </enumValues>
  <enumValues>
    <name>Используется</name>
  </enumValues>
  <enumValues>
    <name>Конвертируется</name>
  </enumValues>
  <enumValues>
    <name>Копируется</name>
  </enumValues>
  <enumValues>
    <name>КУдалению</name>
  </enumValues>
  <enumValues>
    <name>Удалена</name>
  </enumValues>
  <enumValues>
    <name>Отсутствует</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаПодготовки</name>
  </enumValues>
  <enumValues>
    <name>ИмпортИзФайла</name>
  </enumValues>
</mdclass:Enum>

БСП_ВА/src/Enums/СостоянияПриложений/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает значение перечисления по имени значения.
//
// Параметры:
//  ИмяЗначения	- Строка - имя значения, как оно передается через API
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СостоянияПриложений - значение перечисления по имени.
//
Функция ЗначениеПоИмени(ИмяЗначения) Экспорт
    
    Если ИмяЗначения = "ready" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Готово");
    ИначеЕсли ИмяЗначения = "preparation" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.ГотовитсяКИспользованию");
    ИначеЕсли ИмяЗначения = "used" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Используется");
    ИначеЕсли ИмяЗначения = "converted" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Конвертируется");
    ИначеЕсли ИмяЗначения = "copied" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Копируется");
    ИначеЕсли ИмяЗначения = "decommissioned" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.КУдалению");
    ИначеЕсли ИмяЗначения = "new" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Новая");
    ИначеЕсли ИмяЗначения = "error" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.ОшибкаПодготовки");
    ИначеЕсли ИмяЗначения = "removed" Тогда
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.Удалена");
    Иначе
        Возврат ПредопределенноеЗначение("Перечисление.СостоянияПриложений.ПустаяСсылка");
    КонецЕсли; 
    
КонецФункции

#КонецОбласти

#КонецЕсли
